УРВ_файловая/src/InformationRegisters/РолиСотрудниковЛК/РолиСотрудниковЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиСотрудниковЛК</name>
  <resources>
    <name>ДоступноСоздание</name>
    <comment>Сотрудник может создать новую запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноИзменение</name>
    <comment>Сотрудник может изменить запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПерепланирование</name>
    <comment>Сотрудник может перенести свою запись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноБлокировка</name>
    <comment>Сотрудник может блокировать свою запись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноОтменаБлокировки</name>
    <comment>Сотрудник может отменить свою запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПросмотрДругихСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиСотрудниковЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/РолиСотрудниковЛК/РолиСотрудниковЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиСотрудниковЛК</name>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>Координатор</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/InformationRegisters/РолиСотрудниковЛК/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если (Запись.Роль <> ПредопределенноеЗначение("Перечисление.РолиСотрудниковЛК.Сотрудник")) Тогда
			Запись.ДоступноСоздание						= Ложь;	
			Запись.ДоступноИзменение					= Ложь;	
			Запись.ДоступноПерепланирование				= Ложь;
			Запись.ДоступноБлокировка					= Ложь;
			Запись.ДоступноОтменаБлокировки				= Ложь;
			//Лобашова 30.05.2019 87280 +
			Запись.ДоступноПросмотрДругихСотрудников	= Ложь;
			//Лобашова 30.05.2019 87280 -
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
